InformationRegisters/бит_Подразделение_Здание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_Подразделение_Здание</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_Подразделение_Здание/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_ЗакрытыйСлужебныйСервер.ПроверитьВозможностьРаботы(Отказ, Истина);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокЗданий();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НаборЗаписей = РегистрыСведений.бит_Подразделение_Здание.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекущийОбъект.Период              , Истина);
	НаборЗаписей.Отбор.Подразделение.Установить(ТекущийОбъект.Подразделение, Истина);
	
	НаборЗаписей.Прочитать();
	
	НаборЗаписей.Очистить();
	
	Для каждого СтрокаТаблицы Из ТаблицаЗданий Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Период        = ТекущийОбъект.Период;
		НоваяЗапись.Подразделение = ТекущийОбъект.Подразделение;
		НоваяЗапись.Здание        = СтрокаТаблицы.Здание;
		
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	
	
	Владелец = ВладелецНаСервере(Запись.Подразделение);
	
	Отбор = Новый Структура("Организация", Владелец);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор"             , Отбор);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", ПараметрыФормы, Элементы.ТаблицаЗданий, ЭтаФорма.КлючУникальности);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Записать();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОбъект(Команда)
	
	Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаЗданийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Для каждого Элемент Из ВыбранноеЗначение Цикл
		
		Отбор = Новый Структура("Здание", Элемент);
		
		МассивСтрок = ТаблицаЗданий.НайтиСтроки(Отбор);
		
		Если МассивСтрок.Количество() = 0 Тогда
			
			НоваяСтрока = ТаблицаЗданий.Добавить();
			
			НоваяСтрока.Здание              = Элемент;
			
			Улица = УлицаНаСервере(Элемент);
			
			НоваяСтрока.ЗданиеПредставление = "ул." + Улица + " ,д " + Элемент;
			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция УлицаНаСервере(Элемент) 
	
Возврат Элемент.Улица;	
	
КонецФункции

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЗаполнитьСписокЗданий();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОчистка(Элемент, СтандартнаяОбработка)
	
	ТаблицаЗданий.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ЗаполнитьСписокЗданий();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗданийЗданиеПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ТаблицаЗданий.ТекущиеДанные;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Здание"        , ВыбранноеЗначение);
	
	МассивСтрок = ТаблицаЗданий.НайтиСтроки(Отбор);
	
	Если МассивСтрок.Количество() > 0 Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Здание уже выбрано.");
		
	Иначе 
		
		ТекущиеДанные.Здание              = ВыбранноеЗначение;
		
		Улица = УлицаНаСервере(ВыбранноеЗначение);
		
		ТекущиеДанные.ЗданиеПредставление = "ул." + Улица + " ,д " + ВыбранноеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗданийЗданиеПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Владелец = ВладелецНаСервере(Запись.Подразделение);
	
	Отбор = Новый Структура("Организация", Владелец);
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗданийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция ВладелецНаСервере(Подразделение)
	
Возврат Подразделение.Владелец;	
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокЗданий()
	
	ТаблицаЗданий.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"         , Запись.Период);
	Запрос.УстановитьПараметр("Подразделение", Запись.Подразделение);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_Подразделение_ЗданиеСрезПоследних.Здание,
	|	бит_Подразделение_ЗданиеСрезПоследних.Здание.Улица КАК Улица
	|ИЗ
	|	РегистрСведений.бит_Подразделение_Здание.СрезПоследних(&дата, Подразделение = &Подразделение) КАК бит_Подразделение_ЗданиеСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаЗданий.Добавить();
		НоваяСтрока.Здание              = Выборка.Здание;
		НоваяСтрока.ЗданиеПредставление = "ул." + Выборка.Улица + " ,д " + Выборка.Здание;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти
